OpenFOAM-10/tutorials/incompressible/pimpleFoam/RAS/waveSubSurface/0/alpha.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    bottom
    {
        type            zeroGradient;
    }
    "(top|inlet|outlet)"
    {
        type            waveAlpha;
    }
    "(front|back)"
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
